app/Http/Controllers/Auth/RegisteredUserController.php

    public function store(Request $request): RedirectResponse
    {
        $request->validate([
            'name' => ['required', 'string', 'max:255'],
            'email' => ['required', 'string', 'lowercase', 'email', 'max:255', 'unique:'.User::class],
            'password' => ['required', 'confirmed', Rules\Password::defaults()],
        ]);

        $user = User::create([
            'name' => $request->name,
            'email' => $request->email,
            'password' => Hash::make($request->password),
        ]);
---
insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('Туленинов Александр', 'ranblion1@gmail.com', '$2y$12$46U6LThIU7aCFosPHsUdlOZOvHIaX8M7A4sOxV/u2LBY4Zrs9AdU6', '2024-03-12 11:46:56', '2024-03-12 11:46:56')