app/Http/Controllers/DocumentController.php

select * from `documents`
---
    public function index(){
        $documents = Document::all();